app/views/mangas/index.html.erb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% @mangas.each do |manga| %>
	<%@genre = Genre.find(manga.genre_id) %>
	<%@image = Image.find(manga.image_id) %>
	<%@auteur = Auteur.find(manga.auteur_id) %>