app/controllers/auteurs_controller.rb

SELECT "auteurs".* FROM "auteurs"
---
	def index
		@auteurs = Auteur.all

INSERT INTO "auteurs" ("first_name", "last_name") VALUES (?, ?)  [["first_name", ""], ["last_name", ""]]
---
	def create
		@auteur = Auteur.new(auteur_params)
		if(@auteur.save)

UPDATE "auteurs" SET "last_name" = ?, "first_name" = ?, "birthday" = ? WHERE "auteurs"."id" = ?  [["last_name", "Kishimoto"], ["first_name", "Masashi"], ["birthday", "1974-11-08"], ["id", 1]]
---
	def update
		if @auteur.update(auteur_params)

DELETE FROM "auteurs" WHERE "auteurs"."id" = ?  [["id", 5]]
---
	def destroy
		@auteur.destroy

SELECT  "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def set_auteur
		@auteur = Auteur.find(params[:id])