app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@genre = Genre.find(params[:id])

INSERT INTO "genres" ("name", "age", "description") VALUES (?, ?, ?)  [["name", "Test"], ["age", 20], ["description", "Toto "]]
---
	def create
		@genre = Genre.new(params.require(:genre).permit(:name, :age , :description))
		if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "genres" SET "description" = ? WHERE "genres"."id" = ?  [["description", "Ceci est une correction de la "], ["id", 3]]
---
	def update
		@genre = Genre.find(params[:id])
		if @genre.update(
			params.require(:genre).permit(
				:name, :age , :description))

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
	def destroy
		@genre = Genre.find(params[:id])
		@genre.destroy