app/controllers/mangas_controller.rb

SELECT "mangas".* FROM "mangas"
---
	def index
		@mangas = Manga.all

SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@manga = Manga.find(params[:id])

INSERT INTO "mangas" ("title", "title_traduction", "realise_date", "tome_number") VALUES (?, ?, ?, ?)  [["title", "GTO"], ["title_traduction", "GTO traduit"], ["realise_date", "2018-02-16"], ["tome_number", 21]]
---
	def create

		@manga = Manga.new(manga_params)
		@genre = Gnere.new(genre_params)

		if @manga.save

SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "mangas" WHERE "mangas"."id" = ?  [["id", 1]]
---
	def destroy
		@manga = Manga.find(params[:id])
		@manga.destroy