app/controllers/users_controller.rb

  def check
  	@current_user = User.where(name: params[:name], pw: params[:pw]).first
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."pw" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["name", "test"], ["LIMIT", 1]]